#!/usr/bin/env python
# coding: utf-8

# In[3]:


class GaoDe:
    city_code = {
        '阿拉善盟': '152900',
        '鞍山': '210300',
        '安庆': '340800',
        '安阳': '410500',
        '阿坝藏族羌族自治州': '513200',
        '安顺': '520400',
        '阿里': '542500',
        '安康': '610900',
        '阿克苏': '652900',
        '阿勒泰': '654300',
        '阿拉尔': '659002',
        '澳门': '820000',
        '北京': '110000',
        '保定': '130600',
        '包头': '150200',
        '巴彦淖尔': '150800',
        '本溪': '210500',
        '白山': '220600',
        '白城': '220800',
        '蚌埠': '340300',
        '亳州': '341600',
        '滨州': '371600',
        '北海': '450500',
        '百色': '451000',
        '巴中': '511900',
        '毕节': '520500',
        '保山': '530500',
        '宝鸡': '610300',
        '白银': '620400',
        '博尔塔拉蒙古自治州': '652700',
        '巴音郭楞蒙古自治州': '652800',
        '承德': '130800',
        '沧州': '130900',
        '长治': '140400',
        '赤峰': '150400',
        '朝阳': '211300',
        '长春': '220100',
        '常州': '320400',
        '滁州': '341100',
        '池州': '341700',
        '长沙': '430100',
        '常德': '430700',
        '郴州': '431000',
        '潮州': '445100',
        '崇左': '451400',
        '重庆': '500000',
        '成都': '510100',
        '楚雄彝族自治州': '532300',
        '昌都': '540300',
        '昌吉回族自治州': '652300',
        '大同': '140200',
        '大连': '210200',
        '丹东': '210600',
        '大庆': '230600',
        '大兴安岭': '232700',
        '东营': '370500',
        '德州': '371400',
        '东莞': '441900',
        '儋州': '460400',
        '德阳': '510600',
        '达州': '511700',
        '大理白族自治州': '532900',
        '德宏傣族景颇族自治州': '533100',
        '迪庆藏族自治州': '533400',
        '定西': '621100',
        '鄂尔多斯': '150600',
        '鄂州': '420700',
        '恩施土家族苗族自治州': '422800',
        '抚顺': '210400',
        '阜新': '210900',
        '阜阳': '341200',
        '福州': '350100',
        '抚州': '361000',
        '佛山': '440600',
        '防城港': '450600',
        '赣州': '360700',
        '广州': '440100',
        '桂林': '450300',
        '贵港': '450800',
        '广元': '510800',
        '广安': '511600',
        '甘孜藏族自治州': '513300',
        '贵阳': '520100',
        '甘南藏族自治州': '623000',
        '果洛藏族自治州': '632600',
        '固原': '640400',
        '邯郸': '130400',
        '衡水': '131100',
        '呼和浩特': '150100',
        '呼伦贝尔': '150700',
        '葫芦岛': '211400',
        '哈尔滨': '230100',
        '鹤岗': '230400',
        '黑河': '231100',
        '淮安': '320800',
        '杭州': '330100',
        '湖州': '330500',
        '合肥': '340100',
        '淮南': '340400',
        '淮北': '340600',
        '黄山': '341000',
        '菏泽': '371700',
        '鹤壁': '410600',
        '黄石': '420200',
        '黄冈': '421100',
        '衡阳': '430400',
        '怀化': '431200',
        '惠州': '441300',
        '河源': '441600',
        '贺州': '451100',
        '河池': '451200',
        '海口': '460100',
        '红河哈尼族彝族自治州': '532500',
        '汉中': '610700',
        '海东': '630200',
        '海北藏族自治州': '632200',
        '黄南藏族自治州': '632300',
        '海南藏族自治州': '632500',
        '海西蒙古族藏族自治州': '632800',
        '哈密': '650500',
        '和田': '653200',
        '晋城': '140500',
        '晋中': '140700',
        '锦州': '210700',
        '吉林': '220200',
        '鸡西': '230300',
        '佳木斯': '230800',
        '嘉兴': '330400',
        '金华': '330700',
        '景德镇': '360200',
        '九江': '360400',
        '吉安': '360800',
        '济南': '370100',
        '济宁': '370800',
        '焦作': '410800',
        '济源': '419001',
        '荆门': '420800',
        '荆州': '421000',
        '江门': '440700',
        '揭阳': '445200',
        '嘉峪关': '620200',
        '金昌': '620300',
        '酒泉': '620900',
        '开封': '410200',
        '昆明': '530100',
        '克拉玛依': '650200',
        '克孜勒苏柯尔克孜自治州': '653000',
        '喀什': '653100',
        '廊坊': '131000',
        '临汾': '141000',
        '吕梁': '141100',
        '辽阳': '211000',
        '辽源': '220400',
        '连云港': '320700',
        '丽水': '331100',
        '六安': '341500',
        '龙岩': '350800',
        '临沂': '371300',
        '聊城': '371500',
        '洛阳': '410300',
        '漯河': '411100',
        '娄底': '431300',
        '柳州': '450200',
        '来宾': '451300',
        '泸州': '510500',
        '乐山': '511100',
        '凉山彝族自治州': '513400',
        '六盘水': '520200',
        '丽江': '530700',
        '临沧': '530900',
        '拉萨': '540100',
        '林芝': '540400',
        '兰州': '620100',
        '陇南': '621200',
        '临夏回族自治州': '622900',
        '牡丹江': '231000',
        '马鞍山': '340500',
        '茂名': '440900',
        '梅州': '441400',
        '绵阳': '510700',
        '眉山': '511400',
        '南京': '320100',
        '南通': '320600',
        '宁波': '330200',
        '南平': '350700',
        '宁德': '350900',
        '南昌': '360100',
        '南阳': '411300',
        '南宁': '450100',
        '内江': '511000',
        '南充': '511300',
        '怒江傈僳族自治州': '533300',
        '那曲': '540600',
        '盘锦': '211100',
        '莆田': '350300',
        '萍乡': '360300',
        '平顶山': '410400',
        '濮阳': '410900',
        '攀枝花': '510400',
        '普洱': '530800',
        '平凉': '620800',
        '秦皇岛': '130300',
        '齐齐哈尔': '230200',
        '七台河': '230900',
        '衢州': '330800',
        '泉州': '350500',
        '青岛': '370200',
        '潜江': '429005',
        '清远': '441800',
        '钦州': '450700',
        '黔西南布依族苗族自治州': '522300',
        '黔东南苗族侗族自治州': '522600',
        '黔南布依族苗族自治州': '522700',
        '曲靖': '530300',
        '庆阳': '621000',
        '日照': '371100',
        '日喀则': '540200',
        '石家庄': '130100',
        '朔州': '140600',
        '沈阳': '210100',
        '四平': '220300',
        '松原': '220700',
        '双鸭山': '230500',
        '绥化': '231200',
        '上海': '310000',
        '苏州': '320500',
        '宿迁': '321300',
        '绍兴': '330600',
        '宿州': '341300',
        '三明': '350400',
        '上饶': '361100',
        '三门峡': '411200',
        '商丘': '411400',
        '十堰': '420300',
        '随州': '421300',
        '神农架林区': '429021',
        '邵阳': '430500',
        '韶关': '440200',
        '深圳': '440300',
        '汕头': '440500',
        '汕尾': '441500',
        '三亚': '460200',
        '三沙': '460300',
        '遂宁': '510900',
        '山南': '540500',
        '商洛': '611000',
        '石嘴山': '640200',
        '石河子': '659001',
        '天津': '120000',
        '唐山': '130200',
        '太原': '140100',
        '通辽': '150500',
        '铁岭': '211200',
        '通化': '220500',
        '泰州': '321200',
        '台州': '331000',
        '铜陵': '340700',
        '泰安': '370900',
        '天门': '429006',
        '铜仁': '520600',
        '铜川': '610200',
        '天水': '620500',
        '吐鲁番': '650400',
        '塔城': '654200',
        '图木舒克': '659003',
        '台湾': '710000',
        '乌海': '150300',
        '乌兰察布': '150900',
        '无锡': '320200',
        '温州': '330300',
        '芜湖': '340200',
        '潍坊': '370700',
        '威海': '371000',
        '武汉': '420100',
        '梧州': '450400',
        '文山壮族苗族自治州': '532600',
        '渭南': '610500',
        '武威': '620600',
        '吴忠': '640300',
        '乌鲁木齐': '650100',
        '五家渠': '659004',
        '邢台': '130500',
        '忻州': '140900',
        '兴安盟': '152200',
        '锡林郭勒盟': '152500',
        '徐州': '320300',
        '宣城': '341800',
        '厦门': '350200',
        '新余': '360500',
        '新乡': '410700',
        '许昌': '411000',
        '信阳': '411500',
        '襄阳': '420600',
        '孝感': '420900',
        '咸宁': '421200',
        '仙桃': '429004',
        '湘潭': '430300',
        '湘西土家族苗族自治州': '433100',
        '西双版纳傣族自治州': '532800',
        '西安': '610100',
        '咸阳': '610400',
        '西宁': '630100',
        '香港': '810000',
        '阳泉': '140300',
        '运城': '140800',
        '营口': '210800',
        '延边朝鲜族自治州': '222400',
        '伊春': '230700',
        '盐城': '320900',
        '扬州': '321000',
        '鹰潭': '360600',
        '宜春': '360900',
        '烟台': '370600',
        '宜昌': '420500',
        '岳阳': '430600',
        '益阳': '430900',
        '永州': '431100',
        '阳江': '441700',
        '云浮': '445300',
        '玉林': '450900',
        '宜宾': '511500',
        '雅安': '511800',
        '玉溪': '530400',
        '延安': '610600',
        '榆林': '610800',
        '玉树藏族自治州': '632700',
        '银川': '640100',
        '伊犁哈萨克自治州': '654000',
        '张家口': '130700',
        '镇江': '321100',
        '舟山': '330900',
        '漳州': '350600',
        '淄博': '370300',
        '枣庄': '370400',
        '郑州': '410100',
        '周口': '411600',
        '驻马店': '411700',
        '株洲': '430200',
        '张家界': '430800',
        '珠海': '440400',
        '湛江': '440800',
        '肇庆': '441200',
        '中山': '442000',
        '自贡': '510300',
        '资阳': '512000',
        '遵义': '520300',
        '昭通': '530600',
        '张掖': '620700',
        '中卫': '640500'
    }
    url = 'https://restapi.amap.com/v3/place/text'
    params = {
        's': 'rsv3',
        'key': '6e79f6d236e295632f21b385e363b6e8',
        'city': '--补充--',
        'extensions': 'all',
        'csid': '--get_csid()--',
        'keywords': '--补充--'
    }
    headers = {
        'Referer': 'https://lbs.amap.com/',
        'Host': 'restapi.amap.com',
        'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko)',
    }
    cols = ['id', 'name', 'address', 'pname', 'cityname', 'adname', 'location', 'typecode', 'type']
    
    def __init__(self, ignores=[], equals={}):
        self.ignores = ['(暂停营业)', '暂停营业', '(装修中)', '装修中'] + ignores
        self.equals = equals
    
    def get_csid(self):
        from random import choice, randint
        """
        高德会检测 headers 传入的 csid 参数，每次发送的 csid 需要不相同
        """
        string = '0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'
        res = list()
        for i in range(36):
            res.append(choice(string))
        res[8] = res[13] = res[18] = res[23] = "-"
        return ''.join(res)
    
    def get_poi_result(self, poi_type, part_pois): # ['商场', '银行', '保险'] or '银行'
        poi_type = [poi_type] if isinstance(poi_type, str) else poi_type
        for item in poi_type:
            for poi in part_pois:
                if item in poi['type']:
                    return poi
        return False
    
    def get_citycode(self, city):
        for i, j in self.city_code.items():
            if i in city:
                return j
        return '100000'
#         res = [j for i, j in self.city_code.items() if i in city or city in i]
#         return res[0] if res else '100000'
    
    def get_score(self, search_name, result_name, search_addr, result_addr):
        """
        search_name、search_addr: 搜索关键字poi名称、地址
        result_name、result_addr: 结果poi名称、地址
        判断 搜索与结果名称的得分，以及 搜索与结果地址匹配得分，保留较高的得分结果
        """
        from fuzzywuzzy import fuzz
        for ignore in self.ignores:
            result_name = result_name.replace(ignore, '')
        for key, val in self.equals.items():
            search_name = search_name.replace(key, val)
            result_name = result_name.replace(key, val)
        name_score = fuzz.ratio(search_name, result_name)
        addr_score = fuzz.ratio(search_addr, result_addr)
        return max(name_score, addr_score)
    
    def main_func(self, data, name_col, addr_col, city_col, poi_type='', mode='name'):
        from tqdm.notebook import tqdm
        import requests
        """
        mode: name, addr, name+addr, addr+name
            拼接模式默认使用前一个参数的前15个字符
        poi_type: '', '银行', ['银行', '自动提款机']
            默认为空，表示不进行类别判断，可传入列表判断多种类型
        """
        name_cols = {'name': name_col, 'addr': addr_col}
        base_cols = ['origin_name', 'origin_addr', 'score']
        result = pd.DataFrame(columns=self.cols+base_cols, dtype='object')
        params = self.params.copy()
        items = [name_cols[i] for i in mode.split('+')]
        total_rows = len(data)
        for ind, row in tqdm(data.iterrows(), desc='地址查询进度', total=total_rows, miniters=5):
            addr = row[addr_col] if not isinstance(row[addr_col], float) else ''
            keywords = row[addr_col][:15] + ' ' + addr
            params['keywords'] = keywords[:50].strip('`\t\n\r ') # 关键字最大长度为80
            params['city'] = self.get_citycode(row[city_col])
            while True:
                params['csid'] = self.get_csid()
                pois = requests.get(self.url, params=params, headers=self.headers).json()
                print(pois)
                if 'pois' in pois:
                    pois = pois['pois']
                    break
                print(pois, params)
            get_result = False if not pois else self.get_poi_result(poi_type, pois) if poi_type else pois[0]
            if get_result:
                score = self.get_score(row[name_col], get_result['name'], addr, get_result['address'])
                result.loc[ind, self.cols] = [get_result[i] if i in get_result else '' for i in self.cols]
            else:
                score = -1
            result.loc[ind, base_cols] = [row[name_col], row[addr_col], score]
        return result


# In[28]:


import pandas as pd

data = pd.read_excel('./测试数据.xlsx')
data['name'] = data[['bank', 'bank_name']].apply(lambda x: x['bank']+'('+x['bank_name']+')', axis=1)
data = data[data.prov.str.contains('上海')]
data.head()


# In[21]:


ignores = ['24小时', '金融便利店', '自助银行', '自动提款机', '市', 'ATM']
equals = {'分理处': '支行', '分行': '支行'}
test_gaode = GaoDe(ignores, equals).main_func(data, 'name', 'address', 'city', poi_type='银行', mode='addr+name')
test_gaode


# In[ ]:


import pandas as pd
data = pd.read_csv('./city_data.csv') # 合作联盟有限公司 股份有限公司 有限责任公司
ignores = ['24小时', '金融便利店', '自助银行', '自动提款机', '市', 'ATM']
equals = {'分理处': '支行', '分行': '支行'}
gaode_result = GaoDe(ignores, equals).main_func(data, 'name', 'address', 'city',
                                                poi_type='银行', mode='addr+name')


# In[1]:


get_ipython().system('pip install tqdm')


# In[ ]:




